{
  "careers": [
    {
      "name": "1. Senior Software Engineer",
      "location": "Clarksburg-MD",
      "responsibilities": [" Work with support teams to ensure that the Discovery tool has the appropriate access and permissions to capture configuration information ",
       " Perform day-to-day administration of the ServiceNow Service Mapping/Discovery tool, including mapping additional defined business services into the tool and updating discovery configurations for deeper network penetration ",
       " Assist the CMDB Administrator with developing and maintain the technical design of the ServiceNow CMDB to meet the current and anticipated scope and maintain CMDB integrity to effectively support other ITSM processes such as Incident Mgt., Change Mgt., and Asset Mgt.",
       " Implement data governance through identification rules and configuration of multiple discovery sources that populate the CMDB.",
       " Strong hands-on experience in optimizing discovery, tailoring patterns and development.",
       " Validating discovery results and troubleshooting as required",
       " Assist the CMDB Administrator team with designing, deploying, and managing ServiceNow Service Mapping solutions for both on-premise and cloud resources, including schedules, credentials, and mid-servers.",
       " Define, create, and manage Service Mapping infrastructure, including patterns",
       " Work with support teams to identify, investigate and resolve Service Mapping issues, ensuring that Service Mapping is performing as expected."
       ],
      "minimumQualification": [" Bachelor's degree in Computer Science or related field"],
      "specialQualifications": [" Experience with software design and development in a test-driven environment", " Knowledge of coding languages (e.g., Java, JavaScript, Python)"],
      "requirements": [
        " Lead requirements analysis, document, and develop on the ServiceNow platform",
        " Integrate ServiceNow with other tools such as Workday, AD, Okta, Office",
        " The candidate will understand ServiceNow functionality and how all ITIL processes can be implemented in ServiceNow. This includes, but is not limited to, incident, request, change, problem, knowledge, SLA, configuration, asset, portal, service catalog, and reporting, including Performance Analytics.",
        " System integration experience using web services and other web-based technologies such as XML, HTML, AJAX, CSS, HTTP, REST/SOAP",
        " Knowledge of networking including TCP/IP ports and firewalls, network protocols, and IP networks",
        " Strong written and verbal communication skills (English)",
        " Strong analytical and problem-solving skills",
        " Experience presenting and conducting demos with stakeholders",
        " Experience with Business Rules, Script Includes, UI Actions, Scheduled Jobs - all scripted aspects of the ServiceNow system",
        " Experience in with scripting languages: JavaScript, Python, Perl, Unix Shell, Windows Shell",
        " Experience with relational databases",
        " Experience on ServiceNow Platform ITSM and ITOM",
        " Experience in JavaScript, HTML, CSS",
        " Experience in developing Applications using ServiceNow Portal",
        " Experience in integrating applications.",
        " Expert in developing and integrating custom applications using ServiceNow Portal",
        " Configuring and developing customer applications using ServiceNow platform",
        " Ability to learn new technology.",
        " Very good in Verbal and Written communication",
        " Experience of Platform Upgrades",
        " Experience in HR and Facilities domain"
      ]
    },
     {
      "name": "2. Technical Project Manager",
      "location": "Clarksburg, MD, USA",
      "responsibilities": [" Manage Project Scope and Sprint scope progress, risk and issues, including documenting, communicating and facilitating status reports and action items.", 
      " Develop and distribute timely meeting minutes, to include track/manage action items and verify they are incorporated into the program schedule and that deliverables are met on time.",
       " Coordinate and facilitate project meetings.", 
       " Assess/Manage risk, impacts and potential alternatives and escalate as required to the appropriate level of management.",
       " Develop, initiate and manage a communication plan, including regular project status reports for executive staff.",
       " Develop and maintain effective and proactive relationships with all customers including third parties.",
       " Manage vendors and cross functional project teams and ensure on time delivery.",
       " Provide clear ownership for and visibility of the resolution of all project risks and issues.",
       " Report on project success criteria results, metrics, and test and deployment management activities.",
       " Work creatively and analytically in a problem-solving environment demonstrating teamwork, innovation and excellence.",
       " Participate in establishing mature PMO practices, templates, policies, tools and partnerships to expand these capabilities for the organization.",
       " Monitor, track and control outcomes to resolve issues, conflicts, dependencies and critical path deliverables."
       ],
      "minimumQualification": [" Bachelor's degree in Computer Science or related field"],
      "specialQualifications": [" Experience with software design and development in a test-driven environment", "2. Knowledge of coding languages (e.g., Java, JavaScript, Python)"],
      "requirements": [
        " Strong oral and written communication skills, and demonstrated ability to influence others",
        " 8+ years of experience as a Project Manager in an Agile environment.",
        " 2+ years of Cloud experience (AWS or Azure)",
        " 2-year experience with Migration project from on prem to (AWS or Azure)",
        " Strong analytical ability that enables you to break down complex problems and synthesize insights from data",
        " Organizational skills to manage multiple projects and priorities",
        " Experience with stakeholder management",
        " Experience with Jira and Agile methodology"
      ]
    },
     {
      "name": "3. Devops Engineer",
      "location": "Clarksburg, MD, USA",
      "responsibilities": [" DevOps Officer: Manages the DevOps implementation in an organization",
       " Release Manager: Helps in the integration of new features into existing features.",
       " Automation Engineer: Works with developers to analyze and design different strategies for deployment.",
       " Tester: Tests the code to remove any bugs or fix any existing issues to ensure everything runs smoothly.",
       " Developer: Performs the actual coding of the application."
       ],
      "minimumQualification": [" Bachelor's degree in Computer Science or related field"],
      "specialQualifications": [" Experience with software design and development in a test-driven environment", " Knowledge of coding languages (e.g., Java, JavaScript, Python)"],
      "requirements": [
        " Help in testing code and programs to identify bugs that may affect the performance of the applications.",
        " Provide support to the customers both externally and internally.",
        " Help in improving performance through analysis, modifications, and providing solutions.",
        " Manage other teams of DevOps engineers.",
        " Provide maintenance and troubleshooting services when deploying applications to ensure smooth running.",
        " Automation of different workloads across different cloud providers like Amazon Web Services, Google Cloud Services, Google Cloud Platform, etc.",
        " Help in using the continuous integration and deployment tools to automate most deployment and testing activities. It helps in promoting agile practices amongst the teams.",
        " Improving customer experience by using different tooling and practices in creating services like playbooks. Help in dealing with the customer's KPI.",
        " Coaching team members who have skill gaps and develop training methods and resources to fill the gaps.",
        " Managing the team's questions and providing feedback to ensure the development process evolves and there are clear methods of communication.",
        " Help in monitoring and improving the network of the software.",
        " Help in the management of the application infrastructure.",
        " Ensuring both the deployment, development, and production environments are safe from cybersecurity threats.",
        " Help in project planning of applications by providing development risks, costs, plans, impacts, etc.",
        " Help the team build, install, code, maintain, and configure applications.",
        " Perform system analysis of the applications by checking the technologies and see how they can improve the application by recommending new requirements.",
        " Help in writing documentation for server-side applications and listing their specifications."
      ]
    },
     {
      "name": "4. SR QA Automation Engineer",
      "location": "Clarksburg, MD",
      "responsibilities": [" Develop high-quality software design and architecture", " Identify, prioritize, and execute tasks in the software development life cycle", " Develop tools and applications by producing clean, efficient code", " Automate tasks through appropriate tools and scripting"],
      "minimumQualification": [" Degree in Computer Science, Electronics Engineering or related field."],
      "specialQualifications": [" 10+ year of experience working as a Quality Assurance Engineer", 
      " Experience in manual testing",
      " Experience in automation testing"],
      "requirements": [
        " Ability to engage and influence senior leaders.",
        " Ability to inspire, motivate, and lead other team members.",
        " Ability to use data and metrics to back up assumptions and define roadmaps.",
        " Ability to work with cross-functional internal teams.",
        " Ability to work with multiple priorities and make things happen quickly.",
        " Excellent writing and verbal communications skills.",
        " Experience converting high-level product requirements into successful test setup, engineering design and implementation.",
        " Experience in hands-on modern script programming languages (i.e. Python).",
        " Excellent problem solving skills.",
        " Demonstrated ability to mentor junior engineers.",
        " Demonstrated success delivering high quality, innovative end-2-end system test solutions and test reports.",
        " Experience developing software using IDE in a SOA, Client-service environment",
        " Experience designing and developing automation test frameworks and tools in JavaScript, Java or C#/C++, or equivalent experience",
        " Experience with standard QA tools and practices, such as functional API testing, integration testing, and UI functionality and usability testing, with a passion for automation"
      ]
    },
     {
      "name": "5. Senior Business Data Engineer",
      "location": "Clarksburg, MD, USA",
      "responsibilities": [" The candidate will demonstrate exceptional impact in delivering projects in terms of architecture, technical deliverables and project delivery throughout the project lifecycle. The candidate is expected to be conversant with Agile methodologies and tools and have a track record of delivering products in a production environment",
      " Work with a team of experts in deep learning, machine learning, distributed systems, program management, and product teams, and work on all aspects of design, development and delivery of deep learning enabled end-to-end pipelines and solutions.",
      " Lead the development of technical solutions and implement architectures for project and products across data engineering and data science teams",
      " Lead the architecture, design, and development of new intelligent power technology products and production quality end to end systems",
      " Experience on ML/AI Software development environment",
      " Work with your team and others, defining the architecture, design, and management of secure, large-scale, highly-distributed, geo-redundant, multi-tenant data stores",
      " Knowledge with microservices, cloud APIS (e.g. AWS and MS Azure)",
      " Is accountable for end-to end delivery of solutions from requirements gathering to production",
      " Author high-quality, highly-performance, unit-tested code to extract and transform data based on business and data science needs"],
      "minimumQualification": [" Bachelor’s degree in computer science or related field."],
      "specialQualifications": [" Experience in Design Thinking or human-centered methods to identify and creatively solve customer needs, through a holistic understanding of customer’s problem area", " Knowledgeable in leveraging multiple data transit protocols and technologies (MQTT, Rest API, JDBC, etc)",
      " Knowledge of Hadoop and MapReduce/Spark or related frameworks",
      " Knowledge of Scala"],
      "requirements": [
        " 5+ years of progressive experience in delivering technology solutions in a production environment using Business Intelligence Tools",
        " 5+ years of experience in the software industry as a Business Data Engineer, with a proven track record of shipping high quality products",
        " 3+ years working with customers (internal and external) on developing requirements and working as a solutions architect to deliver",
        " Experience on Cloud Development Platforms - Azure & AWS and their associated data storage options",
        " Cloud based Analytics (AWI, REST API, Microservices)",
        " Knowledge of IoT technologies, including cloud processing, like Azure IoT Hub.",
        " Relational & non-relational database systems - SQL, Postgres SQL, NoSQL, MongoDB, CosmosDB, DocumentDB",
        " Data Warehousing & ETL - Write complex queries that are accessible, secure and perform in optimized manner that outputs to different consumers and systems",
        " ETL on Big Data Technologies - Hive, Impala",
        " Progamming Knowledge - Java and/or Python and associated IDE's (Eclipse, IntelliJ, PyCharm etc.)",
        " APIs development to support data consumption needs of internal and external stakeholders",
        " Data visualization tools such as Power BI, QlikView and/or Tableau",
        " Data pipelining, scripting, reporting",
        " In-depth knowledge of SOA (Service Oriented Architecture)",
        " Experience in Azure Tools - Blob, SQL,  Hive, Hadoop, Data Factory , Databricks, Azure Functions",
        " SW Development life-cycle process & tools",
        " Agile development methodologies and concepts including handson with Jira, bitbucket and confluence.",
        " Knowledge of streaming technologies like Apache Kafka, AWS Kinesis, Azure EventHubs",
        " Knowledge of streaming technologies like Apache Kafka, AWS Kinesis, Azure EventHubs",
        " Knowledge of Cloudera Hadoop, ML ops",
        " Knowledge of data analysis tools, like Apache Presto, Hive, Azure Data Lake Analytics, AWS Athena, Zeppelin",
        " Ability to specify and write code that is accessible, secure, and performs in an optimized manner with an ability to output to different types of consumers and systems"
      ]
    },
     {
      "name": "6. Senior Pega Engineer",
      "location": "Clarksburg, MD",
      "responsibilities": [" Perform BPM - PEGA PRPC and Java/J2EE Web Applications development and testing", " Develop BPM applications using Pega PRPC 6.x, HCIF, and Smart Dispute Frameworks",
      " Implement Pega Scrum and Agile Methodologies",
      " Participate in the entire Pega Methodology Implementation cycle, including Business Process Modeling, Analysis.",
      " Designing, Development, Integration, Testing, and Deployment of BRE and BPM Applications",
      " Collaborate on various areas of PRPC, including Flows, Flow actions, Correspondence rules, Activities, Declarative rules, and Integration Services",
      " Work with Agents and Listeners for batch processes",
      " Implement SOAP Services and Connectors for external system integration",
      " Participate in requirement gathering to understand end-user requirements and scenarios",
      " Debug and fix issues using Rules Inspector for Harness and Declare Expressions",
      " Utilize debugging and performance tools like Clipboard, Tracer, Pega Log Analyzer (PLA), Performance Analyzer (PAL), and System Management Application (SMA)",
      " Work with rules like Product rules, Rule-set management, export/import tools, and Deployment",
      " Perform code migration and deployment-related activities",
      " Create Test Plans and Test Cases in collaboration with the QA Testing Team",
      " Utilize RDBMS technologies like Oracle SQL, PL/SQL, and MS-SQL",
      " Develop Distributed Applications using Java",
      " Demonstrate ability to quickly learn and adapt in a work environment, with productive interpersonal skills and an understanding of group requirements"
      ],
      "minimumQualification": [" Bachelor's degree in Computer Science or related field"],
      "specialQualifications": [" Experience with software design and development in a test-driven environment", " Knowledge of coding languages (e.g., Java, JavaScript, Python)"],
      "requirements": [
        " Bachelor's degree in Computer Science or related field",
        " Minimum of 7 years of relevant IT experience in BPM - PEGA PRPC and Java/J2EE Web Applications development and testing",
        " Certifications in Pega PRPC, such as Certified Senior System Architect in PRPCV6.2 from Pega Systems, USA, and Oracle Certified Java SE6 Programmer from ORACLE Corp.",
        " Experience with Smart BPM Suite: Pega PRPC 5.x/6.x/7.x",
        " Proficiency in Oracle 11g and familiarity with application/web servers (e.g., Tomcat 6.0, WebSphere 6.0)",
        " Strong programming skills in Java (JDK 1.5/1.6) and SQL/PLSQL",
        " Experience with J2EE technologies, including Servlets, JDBC, Hibernate, and Web Services",
        " Knowledge of markup scripting languages like HTML and XML",
        " Familiarity with frameworks like HCIF, Smart Dispute, and CPMHC",
        " Proficiency in development tools such as PEGA PRPC, Eclipse IDE, TOAD, and SQL Developer",
        " Experience with methodologies like PRPC, AGILE, and SDL",
        " Prior experience in healthcare, insurance, and banking domains",
        " Operating System experience: Windows, UNIX & LINUX"
      ]
    },
    {
      "name": "6. Senior Data Scientist",
      "location": "Clarksburg, MD",
      "responsibilities": [" Lead projects or small teams to unblock and advocate for ML excellence",
      " Adapt standard machine learning methods to leverage modern parallel environments", 
      " Develop highly scalable classifiers and tools using machine learning, data regression, and rules-based models",
      " Suggest, collect, and synthesize requirements to create effective feature roadmaps",
      " Code deliverables in collaboration with the engineering team"],
      "minimumQualification":[" 5+ years of experience in software engineering or a relevant field (3+ years of experience if you have a PhD)",
      " 1+ years of experience in machine learning, recommendation systems, pattern recognition, data mining, artificial intelligence, or a related technical field",
      " Experience developing machine learning models at scale, from inception to business impact",
      " Knowledge of C/C++ and Java, or experience with scripting languages such as Python, Perl, PHP, and/or shell scripts",
      " Track record of setting technical direction, driving consensus, and building successful cross-functional partnerships",
      " Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience"],
      "specialQualifications": [" Masters degree or PhD in Computer Science or a related technical field", "2. Exposure to architectural patterns of large-scale software applications"],
      "requirements": ["Strong programming skills in languages such as Python, Java, Scala, or SQL.",
        "Experience with big data processing frameworks like Apache Hadoop, Apache Spark, or Apache Flink.",
        "Knowledge of database systems such as MySQL, PostgreSQL, MongoDB, or Cassandra.",
        "Ability to design and implement data models to support business requirements.",
        "Experience with designing, implementing, and maintaining ETL processes."
      ]
    }
  ]
}
